<template>
	<view>
		<!-- 背景 -->
		<view :style="style" class="bg_img">
			<image src="../../static/icon_12.png" mode=""></image>
			<image src="../../static/icon_13.png" mode=""></image>
		</view>
		<view class="white" style='height:90%;'>
			<view class="title">
				{{type==1?'平台注册协议须知':'毅木重卡隐私政策'}}
			</view>
			<!-- 内容较多，需要右侧有进度条，进度条样式参考效果图 -->
			<view class="cont-rich" style='position:absolute;overflow-y:auto;width: 100%;'>
				<!-- <rich-text :nodes='content'></rich-text> -->
				<text v-if="type==1">
					一、服务条款的确认及接受

					1、毅木重卡网站（指http://www.yimuzk.cn/及其移动客户端软件、应用程序，以下称“本网站”或者“毅木重卡”）各项电子服务的所有权和运作权归属于“毅木重卡”所有，本网站提供的服务将完全按照其发布的服务条款和操作规则严格执行。您确认所有服务条款并完成注册程序时，本协议在您与本网站间成立并发生法律效力，同时您成为本网站正式用户。

					2、根据国家法律法规变化及本网站运营需要，毅木重卡有权对本协议条款及相关规则不时地进行修改，修改后的内容一旦以任何形式公布在本网站上即生效，并取代此前相关内容，您应不时关注本网站公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本网站；如您继续使用本网站，即视为知悉变动内容并同意接受。

					3、本协议内容中以加粗方式显著标识的条款，请您着重阅读。您点击“同意”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。

					二、服务须知

					1、本网站运用自身开发的操作系统通过国际互联网络为用户提供购买商品等服务。使用本网站，您必须：

					（1）自行配备上网的所需设备，包括个人手机、平板电脑、调制解调器、路由器等；
					（2）自行负担个人上网所支付的与此服务有关的电话费用、网络费用等；
					（3）选择与所安装终端设备相匹配的软件版本，包括但不限于iOS、Android、Windows等多个毅木重卡发布的应用版本。

					2、基于本网站所提供的网络服务的重要性，您确认并同意：

					（1）提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新；
					（2）如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且毅木重卡保留终止您使用本网站各项服务的权利。

					三、订单

					1、使用本网站下订单，您应具备购买相关商品的权利能力和行为能力，如果您在18周岁以下，您需要在监护人的监护参与下才能注册并使用本网站。在下订单的同时，即视为您满足上述条件，并对您在订单中提供的所有信息的真实性负责。

					2、在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与您本人不一致的，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任。

					3、您理解并同意：本网站上销售商展示的商品和价格等信息仅仅是要约邀请，您下单时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址（合同履行地点）、合同履行方式等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售商发出的合同要约；销售商收到您的订单信息后，只有在销售商将您在订单中订购的商品从仓库实际直接向您发出时（以商品出库为标志），方视为您与销售商之间就实际直接向您发出的商品建立了合同关系；如果您在一份订单里订购了多种商品并且销售商只给您发出了部分商品时，您与销售商之间仅就实际直接向您发出的商品建立了合同关系，只有在销售商实际直接向您发出了订单中订购的其他商品时，您和销售商之间就订单中其他已实际直接向您发出的商品才成立合同关系；对于电子书、数字音乐、在线手机充值等数字化商品，您下单并支付货款后合同即成立。当您作为消费者为生活消费需要下单并支付货款的情况下，您货款支付成功后即视为您与销售商之间就已支付货款部分的订单建立了合同关系。

					4、尽管销售商做出最大的努力，但由于市场变化及各种以合理商业努力难以控制因素的影响，本网站无法避免您提交的订单信息中的商品出现缺货、价格标示错误等情况；如您下单所购买的商品出现以上情况，您有权取消订单，销售商亦有权自行取消订单，若您已经付款，则为您办理退款。

					四、配送和交付

					1、您在本网站购买的商品将按照本网站上您所指定的送货地址进行配送。订单信息中列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。您应当清楚准确地填写您的送货地址、联系人及联系方式等配送信息，您知悉并确认，您所购买的商品应仅由您填写的联系人接受身份查验后接收商品，因您变更联系人或相关配送信息而造成的损失由您自行承担。

					2、因如下情况造成订单延迟或无法配送等，本网站将无法承担迟延配送或无法配送的责任：

					（1）客户提供错误信息和不详细的地址；
					（2）货物送达无人签收或拒收，由此造成的重复配送所产生的费用及相关的后果。
					（3）不可抗力，例如：自然灾害及恶劣天气、交通戒严等政府、司法机关的行为、决定或命令、意外交通事故、罢工、法规政策的修改、恐怖事件、抢劫、抢夺等暴力犯罪、突发战争等。

					3、您在本网站购买的商品由毅木重卡的关联方或第三方配送公司（包括顺丰、圆通等，以下称“配送公司”）为您完成订单交付的，系统或单据记录的签收时间为交付时间；您购买的商品采用在线传输方式交付的，销售商向您指定系统发送的时间为交付时间；您购买服务的，生成的电子或者实物凭证中载明的时间为交付时间。

					五、用户个人信息保护及授权

					1、您知悉并同意，为方便您使用本网站相关服务，本网站将存储您在使用时的必要信息，包括但不限于您的真实姓名、性别、生日、配送地址、联系方式、通讯录、相册、日历、定位信息等。除法律法规规定的情形外，未经您的许可毅木重卡不会向第三方公开、透露您的个人信息。毅木重卡对相关信息采取专业加密存储与传输方式，利用合理措施保障用户个人信息的安全。

					2、您知悉并确认，您在注册帐号或使用本网站的过程中，需要提供真实的身份信息，毅木重卡将根据国家法律法规相关要求，进行基于移动电话号码的真实身份信息认证。若您提供的信息不真实、不完整，则无法使用本网站或在使用过程中受到限制，同时，由此产生的不利后果，由您自行承担。

					3、您在使用本网站某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议；您使用前述特定服务，即视为您已阅读并同意接受相关单独协议。

					4、您充分理解并同意：

					（1）接收通过邮件、短信、电话等形式，向在本网站注册、购物的用户、收货人发送的订单信息、促销活动等内容；
					（2）为配合行政监管机关、司法机关执行工作，在法律规定范围内毅木重卡有权向上述行政、司法机关提供您在使用本网站时所储存的相关信息，包括但不限于您的注册信息等，或使用相关信息进行证据保全，包括但不限于公证、见证等；
					（3）毅木重卡依法保障您在安装或使用过程中的知情权和选择权，在您使用本网站服务过程中，涉及您设备自带功能的服务会提前征得您同意，您一经确认，毅木重卡有权开启包括但不限于收集地理位置、读取通讯录、使用摄像头、启用录音等提供服务必要的辅助功能。
					（4）毅木重卡有权根据实际情况，在法律规定范围内自行决定单个用户在本网站及服务中数据的最长储存期限以及用户日志的储存期限，并在服务器上为其分配数据最大存储空间等。

					六、用户行为规范

					1、您同意严格遵守法律法规规章规定，依法遵守以下义务：

					（1）不得制作、传输或发表以下违法信息资料：反对宪法所确定的基本原则，煽动抗拒、破坏宪法和法律法规实施的；危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的，煽动推翻社会主义制度的；损害国家荣誉和利益的；歪曲、丑化、亵渎、否定英雄烈士事迹和精神，侵害英雄烈士的姓名、肖像、名誉、荣誉的；宣扬或煽动实施恐怖主义、极端主义及其活动的；煽动民族仇恨、民族歧视、破坏民族团结的言论；破坏国家宗教政策，宣扬邪教和封建迷信的；散布谣言，扰乱经济秩序和社会秩序的；散布淫秽、色情、暴力或者教唆犯罪的；侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；法律、行政法规禁止的其他内容。
					（2）防范和抵制制作、复制、发布含有下列内容的不良信息资料：标题严重夸张，发表内容与标题严重不符的；不当评述自然灾害、重大事故等灾难的；煽动人群歧视、地域歧视等的；宣扬低俗、庸俗、媚俗内容的；违反社会公德行为的；侵犯未成年人合法权益的；其他对网络生态造成不良影响的内容。

					2、本协议依据国家相关法律法规规章制定，您亦同意严格遵守以下义务：

					（1）从中国大陆向境外传输资料信息时必须符合中国有关法规；
					（2）不得利用本网站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；
					（3）不得干扰本网站的正常运转，不得侵入本网站及国家计算机信息系统；
					（4）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、不文明的等信息资料；
					（5）不得教唆他人从事违法违规或本协议、平台规则所禁止的行为；
					（6）不得利用在本网站注册的账户进行牟利性经营活动；
					（7）不得发布任何侵犯他人个人信息、著作权、商标权等知识产权或合法权利的内容；

					3、您须对自己在网上的言论和行为承担法律责任，您若在本网站上散布和传播反动、色情或其它违反国家法律的信息，本网站的系统记录有可能作为您违反法律的证据。

					七、本网站使用规范

					1、关于移动客户端软件的获取与更新：

					（1）您可以直接从毅木重卡网站上获取毅木重卡移动客户端软件，也可以从得到毅木重卡授权的第三方获取，如果您从未经毅木重卡授权的第三方获取软件或与毅木重卡移动客户端软件名称相同的安装程序，毅木重卡无法保证该软件能够正常使用，并对因此给您造成的损失不予负责；
					（2）为了改善用户体验、完善服务内容，毅木重卡将不断努力开发新的服务，并为您不时提供软件更新，新版本发布后，旧版本的软件可能无法使用，毅木重卡不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。

					2、除非法律允许或毅木重卡书面许可，您使用本网站过程中不得从事下列行为：

					（1）删除本网站及其副本上关于著作权的信息；
					（2）对本网站进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本网站的源代码；
					（3）对毅木重卡拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
					（4）对本网站或者本网站运行过程中释放到任何终端内存中的数据、网站运行过程中客户端与服务器端的交互数据，以及本网站运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经毅木重卡授权的第三方工具/服务接入本网站和相关系统；
					（5）通过修改或伪造网站运行中的指令、数据，增加、删减、变动网站的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
					（6）通过非毅木重卡开发、授权的第三方软件、插件、外挂、系统，登录或使用本网站及服务，或制作、发布、传播上述工具；
					（7）自行或者授权他人、第三方软件对本网站及其组件、模块、数据进行干扰。

					八、违约责任

					1、如果毅木重卡发现或收到他人举报投诉您违反本协议约定或存在任何恶意行为的，毅木重卡有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁、注销等处罚，并公告处理结果。

					2、毅木重卡有权依据合理判断对违反有关法律法规或本协议规定的行为采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，您应独自承担由此而产生的一切法律责任。

					3、您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；毅木重卡因此遭受损失的，您也应当一并赔偿。

					4、除非另有明确的书面说明,毅木重卡不对本网站的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。

					九、所有权及知识产权

					1、您一旦接受本协议，对于您提供、上传、创作、发布在本网站的文字、评论、图片、照片、视频、音频等任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等），您免费授予毅木重卡及其关联公司至保护期终止为止、不可撤销的、全球范围的、排他的许可使用著作权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可许可使用的权利）、肖像权、用户ID名称等相关的全部合法权利权益，就毅木重卡具有诉讼主体资格的权利、权益，毅木重卡有权以自身名义对第三方侵权行为取证及提起诉讼。您同意毅木重卡及其关联公司有权存储、使用、复制、修订、编辑、发布、展示、翻译、分发、推广、出版、发行、信息网络传播您以上信息内容，有权改编制作派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。

					2、毅木重卡有权再许可给其他第三方第九条第一款的所有权利。

					3、您应确保在毅木重卡网站上发表的第九条第一款各类信息内容均不涉及侵犯第三方肖像、隐私、知识产权或其他合法权益。否则毅木重卡有权随时采取包括但不限于删除、断开链接等措施。

					4、本协议已经构成《中华人民共和国著作权法》第二十四条（条文序号依照2010年修订版《著作权法》确定）及相关法律规定的著作财产权等权利许可使用的书面协议，其效力及于您在本网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。

					5、您同意并已充分了解本协议的条款，承诺不将已发表于本网站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。

					6、除法律另有强制性规定外，未经毅木重卡明确的特别书面同意,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本网站的信息内容，否则，毅木重卡有权追究其法律责任。

					7、本网站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是毅木重卡或其内容提供者的财产，受中国和国际版权法的保护。本网站上所有内容的汇编是毅木重卡的排他财产，受中国和国际版权法的保护。本网站上所有软件都是毅木重卡或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。

					十、法律管辖适用及其他

					1、本协议的订立、执行和解释及争议的解决均应适用中国法律。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，应向协议签订地有管辖权的人民法院提起诉讼。本协议签订地为中华人民共和国北京市大兴区。

					2、如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。

					3、本协议未明示授权的其他权利仍由毅木重卡保留，您在行使这些权利时须另外取得毅木重卡的书面许可。毅木重卡如果未行使前述任何权利，并不构成对该权利的放弃。
				</text>

				<!-- 隐私政策 -->
				<text v-if="type==2">
					您在使用我们的服务时，我们可能会收集和使用您的相关信息。
					我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。
					本《隐私政策》与您所使用的服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。
					本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。
					您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。
					如对本《隐私政策》或相关事宜有任何问题，请通过yimuzksc@163.com与我们联系。

					<text class="strong">我们可能收集的信息</text>

					我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。

					<text class="strong">您提供的信息</text>

					您在使用我们的服务时，向我们提供的相关个人信息，例如电话号码、电子邮件或银行卡号等；
					您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。

					<text class="strong">其他方分享的您的信息</text>

					其他方使用我们的服务时所提供有关您的共享信息。

					<text class="strong">我们获取的您的信息</text>

					您使用服务时我们可能收集如下信息：
					日志信息，指您使用我们的服务时，系统可能通过cookies、web beacon或其他方式自动采集的技术信息，包括：
					设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；
					在使用我们服务时搜索或浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；
					有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息；
					位置信息，指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息，包括：
					您通过具有定位功能的移动设备使用我们的服务时，通过GPS或WiFi等方式收集的您的地理位置信息；
					您或其他用户提供的包含您所处地理位置的实时信息，例如您提供的账户信息中包含的您所在地区信息，您或其他人上传的显示您当前或曾经所处地理位置的共享信息；
					您可以通过关闭定位功能，停止对您的地理位置信息的收集。

					<text class="strong">我们可能如何使用信息</text>

					我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：
					向您提供服务；
					在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
					帮助我们设计新服务，改善我们现有服务；
					使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；
					向您提供与您更加相关的广告以替代普遍投放的广告；
					评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；
					软件认证或管理软件升级；
					让您参与有关我们产品和服务的调查。
					为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。
					我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障账户安全。

					<text class="strong">我们可能分享的信息</text>

					除以下情形外，未经您同意，我们不会与任何第三方分享您的个人信息：
					我们可能将您的个人信息与第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在的法域），用作下列用途：
					向您提供我们的服务；
					实现“我们可能如何使用信息”部分所述目的；
					履行我们在本《隐私政策》中的义务和行使我们的权利；
					理解、维护和改善我们的服务。
					如我们与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《隐私政策》及我们要求其遵守的其他适当的保密和安全措施。
					随着我们业务的持续发展，我们有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。
					我们还可能为以下需要而保留、保存或披露您的个人信息：
					遵守适用的法律法规；
					遵守法院命令或其他法律程序的规定；
					遵守相关政府机关的要求；
					为遵守适用的法律法规、维护社会公共利益，或保护我们的客户、我们、其他用户的人身和财产安全或合法权益所合理必需的用途

					<text class="strong">信息安全</text>

					我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。
					我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。
					您分享的信息
					我们的多项服务，可让您不仅与自己的社交网络，也与使用该服务的所有用户公开分享您的相关信息，例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是，我们的社交媒体服务，是专为使您与世界各地的用户共享信息而设计，您可以使共享信息实时、广泛地传递。只要您不删除共享信息，有关信息会一直留存在公共领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公共领域保存。
					因此，请您谨慎考虑通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您共享信息的用户范围。如要求从我们的服务中删除您的相关信息，请通过该等特别服务条款提供的方式操作。

					<text class="strong">您分享的敏感个人信息</text>

					某些个人信息因其特殊性可能被认为是敏感个人信息，例如您的种族、宗教、个人健康和医疗信息等。相比其他个人信息，敏感个人信息受到更加严格的保护。
					请注意，您在使用我们的服务时所提供、上传或发布的内容和信息（例如有关您社交活动的照片等信息），可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否在使用我们的服务时披露相关敏感个人信息。
					您同意按本《隐私政策》所述的目的和方式来处理您的敏感个人信息。

					<text class="strong">我们可能如何收集信息</text>

					我们或我们的第三方合作伙伴，可能通过cookies和web beacon收集和使用您的信息，并将该等信息储存为日志信息。
					我们使用自己的cookies和web beacon，目的是为您提供更个性化的用户体验和服务，并用于以下用途：
					记住您的身份。例如：cookies和web beacon有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的喜好或其他信息；
					分析您使用我们服务的情况。例如，我们可利用cookies和web beacon来了解您使用我们的服务进行什么活动，或哪些网页或服务最受您的欢迎；

					<text class="strong">广告优化</text>

					Cookies和web beacon有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放。
					我们为上述目的使用cookies和web beacon的同时，可能将通过cookies和web
					beacon收集的非个人身份信息，经统计加工后提供给广告商或其他合作伙伴，用于分析用户如何使用我们的服务，并用于广告服务。
					我们的产品和服务上可能会有广告商或其他合作方放置的cookies和web beacon。这些cookies和web
					beacon可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方cookies和web
					beacon收集和使用该等信息，不受本《隐私政策》约束，而是受相关使用者的隐私政策约束，我们不对第三方的cookies或web beacon承担责任。
					您可以通过浏览器设置拒绝或管理cookies或web beacon。但请注意，如果停用cookies或web
					beacon，您有可能无法享受最佳的服务体验，某些服务也可能无法正常使用。同时，您还会收到同样数量的广告，但这些广告与您的相关性会降低。

					<text class="strong">广告服务</text>

					我们可能使用您的相关信息，向您提供与您更加相关的广告。
					我们也可能使用您的信息，通过我们的服务、电子邮件或其他方式向您发送营销信息，提供或推广我们或第三方的如下商品和服务：
					我们的服务，我们的关联公司和合作伙伴的商品或服务，包括即时通讯服务、网上媒体服务、互动娱乐服务、社交网络服务、付款服务、互联网搜索服务、位置和地图服务、应用软件和服务、数据管理软件和服务、网上广告服务、互联网金融，以及其他社交媒体、娱乐、电子商务、资讯和通讯软件或服务（统称“互联网服务”）；
					第三方互联网服务供应商，以及与下列有关的第三方商品或服务：食物和餐饮、体育、音乐、电影、电视、现场表演及其他艺术和娱乐、书册、杂志和其他刊物、服装和配饰、珠宝、化妆品、个人健康和卫生、电子、收藏品、家用器皿、电器、家居装饰和摆设、宠物、汽车、酒店、交通和旅游、银行、保险及其他金融服务、会员积分和奖励计划，以及我们认为可能与您相关的其他商品或服务。
					如您不希望我们将您的个人信息用作前述广告用途，您可以通过我们在广告中提供的相关提示，或在特定服务中提供的指引，要求我们停止为上述用途使用您的个人信息。

					<text class="strong">我们可能向您发送的邮件和信息</text>

					邮件和信息推送
					您在使用我们的服务时，我们可能使用您的信息向您的设备发送电子邮件、新闻或推送通知。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅。

					<text class="strong">与服务有关的公告</text>

					我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。

					<text class="strong">隐私政策的适用例外</text>

					我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。例如：
					您利用 “分享”键将某些内容分享到我们的服务，或您利用第三方连线服务登录我们的服务。这些功能可能会收集您的相关信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；
					我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站。
					该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非《通用服务条款》或本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。

					<text class="strong">未成年人使用我们的服务</text>

					我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。

					<text class="strong">隐私政策的适用范围</text>

					除某些特定服务外，我们所有的服务均适用本《隐私政策》。这些特定服务将适用特定的隐私政策。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本《隐私政策》的一部分。如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定服务的隐私政策。
					请您注意，本《隐私政策》不适用于以下情况：
					通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；
					通过在我们服务中进行广告服务的其他公司或机构所收集的信息。

					<text class="strong">变更</text>

					我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。

					信息保护负责人联系电话：13356352052
					联系地址：山东省济南市槐荫区海亮艺术华府11号楼1单元2001室
					常用办公地址：山东省济南市槐荫区海亮艺术华府11号楼1单元2001室
					邮箱：yimuzksc@163.com
					公司名称：山东毅木重卡网络科技有限公司
				</text>

			</view>
			<!-- <view class="span" style='position:absolute;bottom:100rpx;left:0;width:100%:height:100rpx;'>
				<view class="uni-padding-wrap">
					<view>
						<checkbox-group @change='checkchange'>
							<checkbox class="checkbox" style="transform:scale(0.7)" :checked="isOk" value='1'><text
									style="font-size: 28rpx;">我已仔细阅读，并同意履行该协议须知</text></checkbox>
						</checkbox-group>
					</view>
				</view>
			</view> -->
			<view class="uni-padding-wrap uni-common-mt bott" @click="zhuce"
				style='position:absolute;margin:auto;bottom:20rpx;left:calc(50% - 100rpx);width:200rpx;'>
				<button type="primary" style='background:#1a5fe3'>已阅读</button>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				screenHeight: this.screenHeight,
				statusBarHeight: this.statusBarHeight,
				isOk: false,
				phone: '',
				password: '',
				checkCode: '',
				content: '',
				type: '',
			}
		},
		onLoad(option) {
			console.log(option)
			this.type = option.type
			// console.log(option)
			// console.log('-=-=-=-=-=-')
			// console.log(this.CustomBar * 1)
			this.phone = option.phone
			this.password = option.password
			this.checkCode = option.checkCode
			uni.getSystemInfo({
				success: function(e) {
					// console.log(e)
				}
			})
			// this.$https({
			// 	url: '/api/oauth/help/protocol-info',
			// 	data: {},
			// 	dengl: true,
			// 	success: res => {
			// 		this.content = res.data.data.content
			// 		console.log(res.data.data, this.content)
			// 	}
			// })
		},

		computed: {
			style() {
				let style = `height:${this.screenHeight - this.statusBarHeight}px; `;
				return style;
			},

		},
		methods: {
			checkchange(e) {
				this.isOk = e.detail.value[0]
				// console.log(this.isOk)

			},
			zhuce() {
				var _this = this
				uni.navigateBack({
					delta: 1
				})

			}
		}
	}
</script>

<style lang="scss">
	.bg_img {
		width: 100%;

		image:nth-child(1) {
			width: 100%;
			height: 400upx;
			position: absolute;
			top: 0;
			left: 0;
		}

		image:nth-child(2) {
			width: 100%;
			height: 130upx;
			position: fixed;
			bottom: 0;
			left: 0;
		}
	}

	.white {
		z-index: 999999;
		margin: 0 auto;
		background-color: #fff;
		width: 690upx;
		height: initial;
		border-radius: 20upx;
		box-shadow: 0 0 5px #ccc;
		position: fixed;
		top: 5%;
		left: 30upx;
		padding-bottom: 30upx;

		.title {
			text-align: center;
			line-height: 100upx;
			height: 100upx;
			font-size: 36upx;
			border-bottom: 1px solid #ccc;
			font-family: Microsoft YaHei;
		}

		.cont-rich {
			height: calc(100% - 250rpx);
		}

		text {
			display: block;
			padding: 20upx;
			color: #666;
			line-height: 50upx;
			font-size: 26upx;

			.bold {
				font-weight: bold;
				display: inline;
			}

			.strong {
				font-weight: bold;
				color: #000000;
				padding: 0;
				font-size: 28rpx;
			}
		}

		.span {
			font-size: 26upx;
			padding-bottom: 20upx;
			color: #999;
			padding-left: 20upx;
		}

		.span text {
			line-height: 40upx;

		}

		.bott {
			width: 210upx;
			margin: 0 auto;

		}

		.bott button {
			border-radius: 80upx;
		}

	}
</style>
