<template>
	<view>
		<!-- 背景 -->
		<view :style="style" class="bg_img">
			<image src="../../static/icon_12.png" mode=""></image>
			<image src="../../static/icon_13.png" mode=""></image>
		</view>
		<view class="white" style='height:90%;'>
			<view class="title">
				{{type==1?'平台注册协议须知':'毅木重卡隐私政策'}}
			</view>
			<!-- 内容较多，需要右侧有进度条，进度条样式参考效果图 -->
			<view class="cont-rich" style='position:absolute;overflow-y:auto;width: 100%;'>
				<!-- <rich-text :nodes='content'></rich-text> -->
				<text v-if="type==1">
					一、服务条款的确认及接受

					1、毅木重卡网站（指http://www.yimuzk.cn/及其移动客户端软件、应用程序，以下称“本网站”或者“毅木重卡”）各项电子服务的所有权和运作权归属于“毅木重卡”所有，本网站提供的服务将完全按照其发布的服务条款和操作规则严格执行。您确认所有服务条款并完成注册程序时，本协议在您与本网站间成立并发生法律效力，同时您成为本网站正式用户。

					2、根据国家法律法规变化及本网站运营需要，毅木重卡有权对本协议条款及相关规则不时地进行修改，修改后的内容一旦以任何形式公布在本网站上即生效，并取代此前相关内容，您应不时关注本网站公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本网站；如您继续使用本网站，即视为知悉变动内容并同意接受。

					3、本协议内容中以加粗方式显著标识的条款，请您着重阅读。您点击“同意”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。

					二、服务须知

					1、本网站运用自身开发的操作系统通过国际互联网络为用户提供购买商品等服务。使用本网站，您必须：

					（1）自行配备上网的所需设备，包括个人手机、平板电脑、调制解调器、路由器等；
					（2）自行负担个人上网所支付的与此服务有关的电话费用、网络费用等；
					（3）选择与所安装终端设备相匹配的软件版本，包括但不限于iOS、Android、Windows等多个毅木重卡发布的应用版本。

					2、基于本网站所提供的网络服务的重要性，您确认并同意：

					（1）提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新；
					（2）如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且毅木重卡保留终止您使用本网站各项服务的权利。

					三、订单

					1、使用本网站下订单，您应具备购买相关商品的权利能力和行为能力，如果您在18周岁以下，您需要在监护人的监护参与下才能注册并使用本网站。在下订单的同时，即视为您满足上述条件，并对您在订单中提供的所有信息的真实性负责。

					2、在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与您本人不一致的，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任。

					3、您理解并同意：本网站上销售商展示的商品和价格等信息仅仅是要约邀请，您下单时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址（合同履行地点）、合同履行方式等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售商发出的合同要约；销售商收到您的订单信息后，只有在销售商将您在订单中订购的商品从仓库实际直接向您发出时（以商品出库为标志），方视为您与销售商之间就实际直接向您发出的商品建立了合同关系；如果您在一份订单里订购了多种商品并且销售商只给您发出了部分商品时，您与销售商之间仅就实际直接向您发出的商品建立了合同关系，只有在销售商实际直接向您发出了订单中订购的其他商品时，您和销售商之间就订单中其他已实际直接向您发出的商品才成立合同关系；对于电子书、数字音乐、在线手机充值等数字化商品，您下单并支付货款后合同即成立。当您作为消费者为生活消费需要下单并支付货款的情况下，您货款支付成功后即视为您与销售商之间就已支付货款部分的订单建立了合同关系。

					4、尽管销售商做出最大的努力，但由于市场变化及各种以合理商业努力难以控制因素的影响，本网站无法避免您提交的订单信息中的商品出现缺货、价格标示错误等情况；如您下单所购买的商品出现以上情况，您有权取消订单，销售商亦有权自行取消订单，若您已经付款，则为您办理退款。

					四、配送和交付

					1、您在本网站购买的商品将按照本网站上您所指定的送货地址进行配送。订单信息中列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。您应当清楚准确地填写您的送货地址、联系人及联系方式等配送信息，您知悉并确认，您所购买的商品应仅由您填写的联系人接受身份查验后接收商品，因您变更联系人或相关配送信息而造成的损失由您自行承担。

					2、因如下情况造成订单延迟或无法配送等，本网站将无法承担迟延配送或无法配送的责任：

					（1）客户提供错误信息和不详细的地址；
					（2）货物送达无人签收或拒收，由此造成的重复配送所产生的费用及相关的后果。
					（3）不可抗力，例如：自然灾害及恶劣天气、交通戒严等政府、司法机关的行为、决定或命令、意外交通事故、罢工、法规政策的修改、恐怖事件、抢劫、抢夺等暴力犯罪、突发战争等。

					3、您在本网站购买的商品由毅木重卡的关联方或第三方配送公司（包括顺丰、圆通等，以下称“配送公司”）为您完成订单交付的，系统或单据记录的签收时间为交付时间；您购买的商品采用在线传输方式交付的，销售商向您指定系统发送的时间为交付时间；您购买服务的，生成的电子或者实物凭证中载明的时间为交付时间。

					五、用户个人信息保护及授权

					1、您知悉并同意，为方便您使用本网站相关服务，本网站将存储您在使用时的必要信息，包括但不限于您的真实姓名、性别、生日、配送地址、联系方式、通讯录、相册、日历、定位信息等。除法律法规规定的情形外，未经您的许可毅木重卡不会向第三方公开、透露您的个人信息。毅木重卡对相关信息采取专业加密存储与传输方式，利用合理措施保障用户个人信息的安全。

					2、您知悉并确认，您在注册帐号或使用本网站的过程中，需要提供真实的身份信息，毅木重卡将根据国家法律法规相关要求，进行基于移动电话号码的真实身份信息认证。若您提供的信息不真实、不完整，则无法使用本网站或在使用过程中受到限制，同时，由此产生的不利后果，由您自行承担。

					3、您在使用本网站某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议；您使用前述特定服务，即视为您已阅读并同意接受相关单独协议。

					4、您充分理解并同意：

					（1）接收通过邮件、短信、电话等形式，向在本网站注册、购物的用户、收货人发送的订单信息、促销活动等内容；
					（2）为配合行政监管机关、司法机关执行工作，在法律规定范围内毅木重卡有权向上述行政、司法机关提供您在使用本网站时所储存的相关信息，包括但不限于您的注册信息等，或使用相关信息进行证据保全，包括但不限于公证、见证等；
					（3）毅木重卡依法保障您在安装或使用过程中的知情权和选择权，在您使用本网站服务过程中，涉及您设备自带功能的服务会提前征得您同意，您一经确认，毅木重卡有权开启包括但不限于收集地理位置、读取通讯录、使用摄像头、启用录音等提供服务必要的辅助功能。
					（4）毅木重卡有权根据实际情况，在法律规定范围内自行决定单个用户在本网站及服务中数据的最长储存期限以及用户日志的储存期限，并在服务器上为其分配数据最大存储空间等。

					六、用户行为规范

					1、您同意严格遵守法律法规规章规定，依法遵守以下义务：

					（1）不得制作、传输或发表以下违法信息资料：反对宪法所确定的基本原则，煽动抗拒、破坏宪法和法律法规实施的；危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的，煽动推翻社会主义制度的；损害国家荣誉和利益的；歪曲、丑化、亵渎、否定英雄烈士事迹和精神，侵害英雄烈士的姓名、肖像、名誉、荣誉的；宣扬或煽动实施恐怖主义、极端主义及其活动的；煽动民族仇恨、民族歧视、破坏民族团结的言论；破坏国家宗教政策，宣扬邪教和封建迷信的；散布谣言，扰乱经济秩序和社会秩序的；散布淫秽、色情、暴力或者教唆犯罪的；侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；法律、行政法规禁止的其他内容。
					（2）防范和抵制制作、复制、发布含有下列内容的不良信息资料：标题严重夸张，发表内容与标题严重不符的；不当评述自然灾害、重大事故等灾难的；煽动人群歧视、地域歧视等的；宣扬低俗、庸俗、媚俗内容的；违反社会公德行为的；侵犯未成年人合法权益的；其他对网络生态造成不良影响的内容。

					2、本协议依据国家相关法律法规规章制定，您亦同意严格遵守以下义务：

					（1）从中国大陆向境外传输资料信息时必须符合中国有关法规；
					（2）不得利用本网站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；
					（3）不得干扰本网站的正常运转，不得侵入本网站及国家计算机信息系统；
					（4）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、不文明的等信息资料；
					（5）不得教唆他人从事违法违规或本协议、平台规则所禁止的行为；
					（6）不得利用在本网站注册的账户进行牟利性经营活动；
					（7）不得发布任何侵犯他人个人信息、著作权、商标权等知识产权或合法权利的内容；

					3、您须对自己在网上的言论和行为承担法律责任，您若在本网站上散布和传播反动、色情或其它违反国家法律的信息，本网站的系统记录有可能作为您违反法律的证据。

					七、本网站使用规范

					1、关于移动客户端软件的获取与更新：

					（1）您可以直接从毅木重卡网站上获取毅木重卡移动客户端软件，也可以从得到毅木重卡授权的第三方获取，如果您从未经毅木重卡授权的第三方获取软件或与毅木重卡移动客户端软件名称相同的安装程序，毅木重卡无法保证该软件能够正常使用，并对因此给您造成的损失不予负责；
					（2）为了改善用户体验、完善服务内容，毅木重卡将不断努力开发新的服务，并为您不时提供软件更新，新版本发布后，旧版本的软件可能无法使用，毅木重卡不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。

					2、除非法律允许或毅木重卡书面许可，您使用本网站过程中不得从事下列行为：

					（1）删除本网站及其副本上关于著作权的信息；
					（2）对本网站进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本网站的源代码；
					（3）对毅木重卡拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
					（4）对本网站或者本网站运行过程中释放到任何终端内存中的数据、网站运行过程中客户端与服务器端的交互数据，以及本网站运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经毅木重卡授权的第三方工具/服务接入本网站和相关系统；
					（5）通过修改或伪造网站运行中的指令、数据，增加、删减、变动网站的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
					（6）通过非毅木重卡开发、授权的第三方软件、插件、外挂、系统，登录或使用本网站及服务，或制作、发布、传播上述工具；
					（7）自行或者授权他人、第三方软件对本网站及其组件、模块、数据进行干扰。

					八、违约责任

					1、如果毅木重卡发现或收到他人举报投诉您违反本协议约定或存在任何恶意行为的，毅木重卡有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁、注销等处罚，并公告处理结果。

					2、毅木重卡有权依据合理判断对违反有关法律法规或本协议规定的行为采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，您应独自承担由此而产生的一切法律责任。

					3、您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；毅木重卡因此遭受损失的，您也应当一并赔偿。

					4、除非另有明确的书面说明,毅木重卡不对本网站的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。

					九、所有权及知识产权

					1、您一旦接受本协议，对于您提供、上传、创作、发布在本网站的文字、评论、图片、照片、视频、音频等任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等），您免费授予毅木重卡及其关联公司至保护期终止为止、不可撤销的、全球范围的、排他的许可使用著作权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可许可使用的权利）、肖像权、用户ID名称等相关的全部合法权利权益，就毅木重卡具有诉讼主体资格的权利、权益，毅木重卡有权以自身名义对第三方侵权行为取证及提起诉讼。您同意毅木重卡及其关联公司有权存储、使用、复制、修订、编辑、发布、展示、翻译、分发、推广、出版、发行、信息网络传播您以上信息内容，有权改编制作派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。

					2、毅木重卡有权再许可给其他第三方第九条第一款的所有权利。

					3、您应确保在毅木重卡网站上发表的第九条第一款各类信息内容均不涉及侵犯第三方肖像、隐私、知识产权或其他合法权益。否则毅木重卡有权随时采取包括但不限于删除、断开链接等措施。

					4、本协议已经构成《中华人民共和国著作权法》第二十四条（条文序号依照2010年修订版《著作权法》确定）及相关法律规定的著作财产权等权利许可使用的书面协议，其效力及于您在本网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。

					5、您同意并已充分了解本协议的条款，承诺不将已发表于本网站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。

					6、除法律另有强制性规定外，未经毅木重卡明确的特别书面同意,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本网站的信息内容，否则，毅木重卡有权追究其法律责任。

					7、本网站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是毅木重卡或其内容提供者的财产，受中国和国际版权法的保护。本网站上所有内容的汇编是毅木重卡的排他财产，受中国和国际版权法的保护。本网站上所有软件都是毅木重卡或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。

					十、法律管辖适用及其他

					1、本协议的订立、执行和解释及争议的解决均应适用中国法律。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，应向协议签订地有管辖权的人民法院提起诉讼。本协议签订地为中华人民共和国北京市大兴区。

					2、如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。

					3、本协议未明示授权的其他权利仍由毅木重卡保留，您在行使这些权利时须另外取得毅木重卡的书面许可。毅木重卡如果未行使前述任何权利，并不构成对该权利的放弃。
				</text>

				<!-- 隐私政策 -->
				<text v-if="type==2">
					请务必认真阅读和理解本《毅木重卡隐私政策》（以下简称《隐私政策》）中规定的所有权利和限制。除非您接受本《协议》条款，否则您无权注册、登录或使用本协议所涉及的相关服务。您一旦注册、登录、使用或以任何方式使用本《协议》所涉及的相关服务的行为将视为对本《协议》的接受，即表示您同意接受本《协议》各项条款的约束。如果您不同意本《协议》中的条款，请不要注册、登录或使用本《协议》相关服务。本《协议》是用户与毅木重卡商城APP之间的法律协议。

					一、 服务内容

					1、毅木重卡商城APP是只专注于商用车原主机厂高质量配件，向消费者、供应商及其他参与者快速、准确地提供商用车用发动机系统、进排气系统、点火起动供油系统、传动系统、行走系统、制动系统、转向系统、电器、车身及驾驶室等各种高质量的重卡零部件产品，让用户可在毅木重卡APP的平台里进行商贸活动。

					2、您一旦注册成功成为用户，您将得到一个帐号和密码，您需要对自己在帐户中的所有活动和事件负全责。如果由于您的过失导致您的帐号和密码脱离您的控制，则由此导致的针对您、或任何第三方造成的损害，您将承担全部责任。

					3、用户理解并接受，毅木重卡商城APP仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。

					二、 用户使用规则

					1、用户在申请使用毅木重卡商城APP网络服务时，必须向毅木重卡商城APP提供准确的个人资料，如个人资料有任何变动，必须及时更新。 因用户提供个人资料不准确、不真实而引发的一切后果由用户承担。

					2、 用户应妥善保存帐号、密码，
					避免以任何脱离用户控制的形式交由他人使用。如用户发现其帐号遭他人非法使用，应立即通知毅木重卡商城APP。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，毅木重卡商城APP不承担任何责任。

					3、 用户应当为自身注册帐户下的一切行为负责，因用户行为而导致的用户自身或其他任何第三方的任何损失或损害，毅木重卡商城APP 不承担责任。

					4、 用户理解并接受毅木重卡商城APP提供的服务中可能包括医学建议、广告， 用户同意在使用过程中显示毅木重卡商城APP和第三方供应商、合作伙伴提供的广告。

					5、 用户在使用毅木重卡商城APP网络服务过程中，必须遵循以下原则：

					（1） 遵守中国有关的法律和法规；
					（2） 遵守所有与网络服务有关的网络协议、规定和程序；
					（3） 不得为任何非法目的而使用网络服务系统；
					（4） 不得利用毅木重卡商城APP网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；
					（5） 不得利用毅木重卡商城APP提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
					（6） 不得侵犯毅木重卡商城APP和其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；
					（7） 不得利用毅木重卡商城APP网络服务系统进行任何不利于毅木重卡商城APP的行为；
					（8） 如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告毅木重卡商城APP。

					6、如用户在使用网络服务时违反任何上述规定，毅木重卡商城APP或其授权的人有权要求用户改正或直接采取一切必要的措施包括但不限于更改或删除用户收藏的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。

					三、服务变更、中断或终止

					1、 鉴于网络服务的特殊性，用户同意毅木重卡商城APP有权根据业务发展情况随时变更、中断或终止部分或全部的网络服务而无需通知用户，也无需对任何用户或任何第三方承担任何责任；

					2、用户理解，毅木重卡商城APP需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成网络服务在合理时间内的中断，毅木重卡商城APP无需为此承担任何责任，但毅木重卡商城APP应尽可能事先进行通告。

					3、 如发生下列任何一种情形，毅木重卡商城APP有权随时中断或终止向用户提供本《协议》 项下的网络服务（包括收费网络服务）而无需对用户或任何第三方承担任何责任：

					（1） 用户提供的个人资料不真实；
					（2） 用户违反本《协议》中规定的使用规则。

					四、知识产权

					1、提供的网络服务中包含的任何文本、图片、图形、音频或视频资料均受版权、商标或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得用于任何商业目的。

					五、隐私保护

					1、保护用户隐私是毅木重卡商城APP的一项基本政策， 毅木重卡商城APP保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在毅木重卡商城APP的非公开内容，但下列情况除外：

					（1） 事先获得用户的明确授权；
					（2） 根据有关的法律法规要求；
					（3） 按照相关政府主管部门的要求；
					（4） 为维护社会公众的利益；
					（5） 为维护毅木重卡商城APP的合法权益。

					2、毅木重卡商城APP可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与毅木重卡商城APP同等的保护用户隐私的责任，则毅木重卡商城APP有权将用户的注册资料等提供给该第三方。

					3、 在不透露单个用户隐私资料的前提下，毅木重卡商城APP有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。

					4、 毅木重卡商城APP制定了以下四项隐私权保护原则，指导我们如何来处理产品中涉及到用户隐私权和用户信息等方面的问题：

					（1）利用我们收集的信息为用户提供有价值的产品和服务。
					（2）开发符合隐私权标准和隐私权惯例的产品。
					（3）将个人信息的收集透明化，并由权威第三方监督。
					（4）尽最大的努力保护我们掌握的信息。

					六、免责声明

					1、 毅木重卡商城APP不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断， 对网络服务的及时性、安全性、准确性也都不作担保。

					2、 毅木重卡商城APP不保证为向用户提供便利而设置的外部链接的准确性和完整性， 同时， 对于该等外部链接指向的不实际控制的任何网页上的内容，毅木重卡商城APP不承担任何责任。

					3、 对于因电信系统或互联网网络故障、计算机故障或病毒、信息损坏或丢失、计算机系统问题或其它任何不可抗力原因而产生损失，毅木重卡商城APP不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。

					七、法律及争议解决

					1、 本协议适用中华人民共和国法律。

					2、 因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；协商不成的， 任何一方均可将有关争议提交至北京仲裁委员会并按照其届时有效的仲裁规则仲裁；仲裁裁决是终局的，对各方均有约束力。

					八、其他条款

					1、 如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力。

					2、毅木重卡商城APP有权随时根据有关法律、法规的变化以及公司经营状况和经营策略的调整等修改本协议，而无需另行单独通知用户。用户可随时通过网站浏览最新服务协议条款。当发生有关争议时，以最新的协议文本为准。如果不同意毅木重卡商城APP对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受毅木重卡商城APP对本协议相关条款所做的修改。

					3、 毅木重卡商城APP在法律允许最大范围对本协议拥有解释权与修改权。

					4、 APP运营者基本信息

					公司名称：山东毅木重卡网络科技有限公司</text>

			</view>
			<!-- <view class="span" style='position:absolute;bottom:100rpx;left:0;width:100%:height:100rpx;'>
				<view class="uni-padding-wrap">
					<view>
						<checkbox-group @change='checkchange'>
							<checkbox class="checkbox" style="transform:scale(0.7)" :checked="isOk" value='1'><text
									style="font-size: 28rpx;">我已仔细阅读，并同意履行该协议须知</text></checkbox>
						</checkbox-group>
					</view>
				</view>
			</view> -->
			<view class="uni-padding-wrap uni-common-mt bott" @click="zhuce"
				style='position:absolute;margin:auto;bottom:20rpx;left:calc(50% - 100rpx);width:200rpx;'>
				<button type="primary" style='background:#1a5fe3'>已阅读</button>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				screenHeight: this.screenHeight,
				statusBarHeight: this.statusBarHeight,
				isOk: false,
				phone: '',
				password: '',
				checkCode: '',
				content: '',
				type: '',
			}
		},
		onLoad(option) {
			console.log(option)
			this.type = option.type
			// console.log(option)
			// console.log('-=-=-=-=-=-')
			// console.log(this.CustomBar * 1)
			this.phone = option.phone
			this.password = option.password
			this.checkCode = option.checkCode
			uni.getSystemInfo({
				success: function(e) {
					// console.log(e)
				}
			})
			// this.$https({
			// 	url: '/api/oauth/help/protocol-info',
			// 	data: {},
			// 	dengl: true,
			// 	success: res => {
			// 		this.content = res.data.data.content
			// 		console.log(res.data.data, this.content)
			// 	}
			// })
		},

		computed: {
			style() {
				let style = `height:${this.screenHeight - this.statusBarHeight}px; `;
				return style;
			},

		},
		methods: {
			checkchange(e) {
				this.isOk = e.detail.value[0]
				// console.log(this.isOk)

			},
			zhuce() {
				var _this = this
				uni.navigateBack({
					delta: 1
				})
				
			}
		}
	}
</script>

<style lang="scss">
	.bg_img {
		width: 100%;

		image:nth-child(1) {
			width: 100%;
			height: 400upx;
			position: absolute;
			top: 0;
			left: 0;
		}

		image:nth-child(2) {
			width: 100%;
			height: 130upx;
			position: fixed;
			bottom: 0;
			left: 0;
		}
	}

	.white {
		z-index: 999999;
		margin: 0 auto;
		background-color: #fff;
		width: 690upx;
		height: initial;
		border-radius: 20upx;
		box-shadow: 0 0 5px #ccc;
		position: fixed;
		top: 5%;
		left: 30upx;
		padding-bottom: 30upx;

		.title {
			text-align: center;
			line-height: 100upx;
			height: 100upx;
			font-size: 36upx;
			border-bottom: 1px solid #ccc;
			font-family: Microsoft YaHei;
		}

		.cont-rich {
			height: calc(100% - 250rpx);
		}

		text {
			display: block;
			padding: 20upx;
			color: #666;
			line-height: 50upx;
			font-size: 26upx;
		}

		.span {
			font-size: 26upx;
			padding-bottom: 20upx;
			color: #999;
			padding-left: 20upx;
		}

		.span text {
			line-height: 40upx;

		}

		.bott {
			width: 210upx;
			margin: 0 auto;

		}

		.bott button {
			border-radius: 80upx;
		}

	}
</style>
